In [1]:
import numpy as np
import pandas as pd

In [2]:
np.random.seed(121)
data = np.random.randint(1,100,(5,4))
data

array([[67, 86,  9, 96],
       [66, 53, 84, 97],
       [47, 35, 53, 61],
       [55,  4, 95, 53],
       [58, 76, 89, 40]])

In [3]:
subjects = ['PDS','CN','ADA','SE']

In [4]:
rollno = np.arange(101,106)
rollno

array([101, 102, 103, 104, 105])

In [5]:
stu = pd.DataFrame(data,rollno,subjects)

In [6]:
print(stu>35)

      PDS     CN    ADA    SE
101  True   True  False  True
102  True   True   True  True
103  True  False   True  True
104  True  False   True  True
105  True   True   True  True

In [7]:
tempdf = stu>35

In [8]:
stu[tempdf]

     PDS    CN   ADA  SE
101   67  86.0   NaN  96
102   66  53.0  84.0  97
103   47   NaN  53.0  61
104   55   NaN  95.0  53
105   58  76.0  89.0  40

<h1>setting / resetting index</h1>

In [9]:
stu.reset_index()
stu.index.name = "Roll no"
stu

         PDS  CN  ADA  SE
Roll no
101       67  86    9  96
102       66  53   84  97
103       47  35   53  61
104       55   4   95  53
105       58  76   89  40

In [10]:
# for make ADA index

stu.set_index("ADA")

     PDS  CN  SE
ADA
9     67  86  96
84    66  53  97
53    47  35  61
95    55   4  53
89    58  76  40

In [11]:
stu.reset_index()

   Roll no  PDS  CN  ADA  SE
0      101   67  86    9  96
1      102   66  53   84  97
2      103   47  35   53  61
3      104   55   4   95  53
4      105   58  76   89  40

In [12]:
stu

         PDS  CN  ADA  SE
Roll no
101       67  86    9  96
102       66  53   84  97
103       47  35   53  61
104       55   4   95  53
105       58  76   89  40

In [13]:
stu.reset_index(inplace=True)

In [14]:
stu

   Roll no  PDS  CN  ADA  SE
0      101   67  86    9  96
1      102   66  53   84  97
2      103   47  35   53  61
3      104   55   4   95  53
4      105   58  76   89  40

In [15]:
stu.index.name ="ADA"

In [16]:
stu

     Roll no  PDS  CN  ADA  SE
ADA
0        101   67  86    9  96
1        102   66  53   84  97
2        103   47  35   53  61
3        104   55   4   95  53
4        105   58  76   89  40